lib/ecrire/app/controllers/admin/posts_controller.rb

SELECT "posts".* FROM "posts"  WHERE (posts.published_at IS NULL)  ORDER BY posts.created_at
---
    def index
      params[:status] ||= "drafted"
      @posts = Admin::Post.status params[:status]
      @posts = @posts.order('posts.created_at')

SELECT "labels".* FROM "labels"  WHERE 1=0
---
    def edit
      @labels = Admin::Label.all.uniq(&:name)