lib/ecrire/app/controllers/admin/posts_controller.rb

SELECT  1 AS one FROM "posts"  WHERE "posts"."title" = 'A new published post' LIMIT 1
---
    def create
      @post = Admin::Post.create(title: title_params[:title])

      if @post.errors.any?