lib/ecrire/app/controllers/admin/posts_controller.rb

SELECT COUNT(*) FROM "posts"  WHERE (posts.published_at IS NULL)
---
    def index
      @posts = Admin::Post

      if params.has_key?(:q) && !params[:q].blank?
        @titles = Admin::Title.search_by_name(params[:q])
        @posts = @posts.where('id in (?)', @titles.pluck(:post_id).uniq.compact)
      end

      if params.has_key?(:tid) && !params[:tid].blank?
        @posts = @posts.where('? = ANY(posts.tags)', params[:tid])