lib/ecrire/app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("created_at", "excerpt", "slug", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-06-19 14:07:21.483604"], ["excerpt", "..."], ["slug", "just-a-test"], ["title", "Just a test"], ["updated_at", "2014-06-19 14:07:21.483604"]]
---
    def create
      @post = Admin::Post.create post_params

UPDATE "posts" SET "content" = $1, "excerpt" = $2, "updated_at" = $3 WHERE "posts"."id" = 675045402  [["content", "Something to say"], ["excerpt", "Something to say..."], ["updated_at", "2014-06-19 14:07:21.488502"]]
---
    def update
      success = @post.update(post_params)