lib/ecrire/app/controllers/admin/properties_controller.rb

INSERT INTO "labels" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-06-19 13:04:56.745142"], ["name", "Un test"], ["updated_at", "2014-06-19 13:04:56.745142"]]
---
    def create
      @property = post.properties.new
      @property.data = label
      @property.save!