lib/ecrire/app/views/admin/posts/_form.html.erb


      <%= decorate @labels, :button, post: post, properties: post.properties.labels.includes(:data) %>
---
SELECT "labels".* FROM "labels"  WHERE "labels"."id" IN (9)